src/Catalogs/ПравилаКонвертацииОбъектов/ПравилаКонвертацииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ccc4d401-cf65-42ba-a49b-6d263a9418f3">
  <name>ПравилаКонвертацииОбъектов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b962198b-08f3-43fe-ac2d-ac0b43ac5d2d">
    <name>ОбъектКонфигурации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>кфкТабличнаяЧасть</name>
    <type>
      <types>CatalogRef.Свойства</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Объекты/Объекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ac03d05d-31ff-4be8-8134-befc15ed8a20">
  <name>Объекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f6c31941-e0ce-4411-9dc8-1dca828a5160">
    <name>Тип</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>кфкИмяEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="35277a40-8eae-4ba3-886e-04e15c93bfdc">
    <name>Имя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Свойства/Свойства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3707464-2a14-4985-bd92-b2906fe80703">
  <name>Свойства</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="88e0934d-f5b7-4d3b-a324-4f6c5b80407c">
    <name>ТипыСтрокой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e441ff9-cd6f-45c0-a5a8-d6cefa01a348">
    <name>Синоним</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7f9fa1f0-0199-4658-9c43-8575de12ad99">
    <name>КвалификаторыСтроки_Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="89d50220-35f5-4f73-8942-4760660dba77">
    <name>КвалификаторыЧисла_Точность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea9570d1-cf27-4e71-b8a2-f1e06ae94a82">
    <name>КвалификаторыЧисла_Неотрицательное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b991c56-77fb-49ae-8497-7fb5d6407663">
    <name>КвалификаторыДаты_Состав</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cf3a7a6b-fc30-420a-81e1-04256ffec92a">
    <name>КвалификаторыЧисла_Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4241a1f-7376-4978-a1eb-f250ed66f49d">
    <name>КвалификаторыСтроки_Фиксированная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7727b533-9762-4bdd-ae6f-c7bd22ad8be8">
    <name>Вид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>кфкИмяEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>кфкПроверкаЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f50349b9-19fc-4f4a-8966-8a1aa8fc445c">
    <name>Типы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3a1b3e7-3fea-4264-8c13-a0b13219e4b6">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПравилаКонвертацииОбъектов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура кфкПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Группа = Элементы.Вставить("кфкОбъектКонфигурацииТабличнаяЧасть", Тип("ГруппаФормы"), Элементы.ГруппаОбъекты, Элементы.ОбъектФормата);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	
	Элементы.Переместить(Элементы.ОбъектКонфигурации, Группа);
	
	Элемент = Элементы.Добавить("кфкТабличнаяЧасть", Тип("ПолеФормы"), Группа);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.кфкТабличнаяЧасть";
	Элемент.Заголовок = "ТЧ";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура кфкЗаполнитьИдентификаторПосле(Команда)
	
	Если Не ЭтоКонвертацияXDTO Или Объект.ОбъектКонфигурации.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Код = кфкПолучитьИдентификатор(Объект.ОбъектКонфигурации, Объект.кфкТабличнаяЧасть, Объект.ГруппаПравил);
	
	Если Не (Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения) Тогда
		Объект.Код = Объект.Код + ?(Объект.ИспользоватьДляПолучения, "_Получение", "_Отправка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check change-and-validate-instead-of-around
&Вместо("ПроверитьНеобходимостьЗаполненияПКОВПКС")
&НаСервере
Функция кфкПроверитьНеобходимостьЗаполненияПКОВПКС()
	Возврат Ложь;
КонецФункции

&НаСервереБезКонтекста
Функция кфкПолучитьИдентификатор(ОбъектКонфигурации, ТабличнаяЧасть, Группа)
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Объекты.Имя КАК Имя,
	|	Объекты.Тип КАК Тип,
	|	ПРЕДСТАВЛЕНИЕ(Объекты.Родитель) КАК Группа
	|ИЗ
	|	Справочник.Объекты КАК Объекты
	|ГДЕ
	|	Объекты.Ссылка = &Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|ГДЕ
	|	Свойства.Ссылка = &Свойство";
	Запрос.УстановитьПараметр("Объект", ОбъектКонфигурации);
	Запрос.УстановитьПараметр("Свойство", ТабличнаяЧасть);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		
		Группа = Выборка.Группа;
		
		ЧастиИмени = СтрРазделить(Выборка.Имя, "_", Ложь);
		Результат = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Тип) + "_" + ЧастиИмени[ЧастиИмени.ВГраница()];
		
		ВыборкаТЧ = РезультатЗапроса[1].Выбрать();
		Если ВыборкаТЧ.Следующий() Тогда
			ЧастиИмени = СтрРазделить(ВыборкаТЧ[0], "_", Ложь);
			Результат = Результат + "_" + ЧастиИмени[ЧастиИмени.ВГраница()];
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
